<?php
namespace model\upload;

/**
 * 数据表枚举字段值
 *
 * @author 李春寅 <licy2013@aliyun.com>
 * @since 2018年11月28日
 */
class Code
{
    /*********************************************************************************************************
     * type 字段
    *********************************************************************************************************/
    const TYPES                 = [
        self::TYPE_GERNERAL     => '普通文件',
        self::TYPE_VIDEO_SYNC   => '视频同步', // 发布到各个平台的视频
    ];
    const TYPE_GERNERAL         = '1';
    const TYPE_VIDEO_SYNC       = '2';
    /********************************************************************************************************/
}
